Public Attributes | List of all members
API_MarqueeFilter Struct Reference
Selection handling
Defines the filter for 3D filter and cut settings. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_MarqueeConversionFilter  | elemsInMarquee
ConvertElemsInMarquee: convert what's in the marquee rectangle.
 ConvertElemsOutsideMarquee: convert what's outside the marquee rectangle.
bool  | trimToMarquee
Trim to marquee.
short  | marqueeStory
The story for the single-story marquee rectangle.
API_MarqueeType  | marqueeType
It can be a single story (SingleStory) or an all story (MultiStory) marquee rectangle.
Detailed Description
Defines the filter for 3D filter and cut settings.
Member Data Documentation
◆ elemsInMarquee
 API_MarqueeFilter::elemsInMarquee
ConvertElemsInMarquee: convert what's in the marquee rectangle.
 ConvertElemsOutsideMarquee: convert what's outside the marquee rectangle.
◆ marqueeStory
 API_MarqueeFilter::marqueeStory
The story for the single-story marquee rectangle.
◆ marqueeType
 API_MarqueeFilter::marqueeType
It can be a single story (SingleStory) or an all story (MultiStory) marquee rectangle.
◆ trimToMarquee
 API_MarqueeFilter::trimToMarquee
Trim to marquee.